; domain
(define (domain sokoban)
  (:requirements :typing :action-costs)
  (:types thing location direction - object
          player stone - thing)
  (:predicates (clear ?l - location)
	       (at ?t - thing ?l - location)
	       (at-goal ?s - stone)
	       (IS-GOAL ?l - location)
	       (IS-NONGOAL ?l - location)
               (MOVE-DIR ?from ?to - location ?dir - direction))
  

  (:action move
   :parameters (?p - player ?from ?to - location ?dir - direction)
   :precondition (and (at ?p ?from)
                      (clear ?to)
                      (MOVE-DIR ?from ?to ?dir)
                      )
   :effect       (and (not (at ?p ?from))
                      (not (clear ?to))
                      (at ?p ?to)
                      (clear ?from)
                      )
   )

  (:action push-to-nongoal
   :parameters (?p - player ?s - stone
                ?ppos ?from ?to - location
                ?dir - direction)
   :precondition (and (at ?p ?ppos)
                      (at ?s ?from)
                      (clear ?to)
                      (MOVE-DIR ?ppos ?from ?dir)
                      (MOVE-DIR ?from ?to ?dir)
                      (IS-NONGOAL ?to)
                      )
   :effect       (and (not (at ?p ?ppos))
                      (not (at ?s ?from))
                      (not (clear ?to))
                      (at ?p ?from)
                      (at ?s ?to)
                      (clear ?ppos)
                      (not (at-goal ?s))
                      )
   )

  (:action push-to-goal
   :parameters (?p - player ?s - stone
                ?ppos ?from ?to - location
                ?dir - direction)
   :precondition (and (at ?p ?ppos)
                      (at ?s ?from)
                      (clear ?to)
                      (MOVE-DIR ?ppos ?from ?dir)
                      (MOVE-DIR ?from ?to ?dir)
                      (IS-GOAL ?to)
                      )
   :effect       (and (not (at ?p ?ppos))
                      (not (at ?s ?from))
                      (not (clear ?to))
                      (at ?p ?from)
                      (at ?s ?to)
                      (clear ?ppos)
                      (at-goal ?s)
                      )
   )
)

; problem
;; #####
;; #@  #
;; # $ #
;; #  *##
;; ##**+#
;; #  ###
;; #  #
;; #  #
;; ####

(define (problem p005-multiban-temporal)
  (:domain sokoban)
  (:objects
    dir-down - direction
    dir-left - direction
    dir-right - direction
    dir-up - direction
    player-01 - player
    player-02 - player
    pos-1-1 - location
    pos-1-2 - location
    pos-1-3 - location
    pos-1-4 - location
    pos-1-5 - location
    pos-1-6 - location
    pos-1-7 - location
    pos-1-8 - location
    pos-1-9 - location
    pos-2-1 - location
    pos-2-2 - location
    pos-2-3 - location
    pos-2-4 - location
    pos-2-5 - location
    pos-2-6 - location
    pos-2-7 - location
    pos-2-8 - location
    pos-2-9 - location
    pos-3-1 - location
    pos-3-2 - location
    pos-3-3 - location
    pos-3-4 - location
    pos-3-5 - location
    pos-3-6 - location
    pos-3-7 - location
    pos-3-8 - location
    pos-3-9 - location
    pos-4-1 - location
    pos-4-2 - location
    pos-4-3 - location
    pos-4-4 - location
    pos-4-5 - location
    pos-4-6 - location
    pos-4-7 - location
    pos-4-8 - location
    pos-4-9 - location
    pos-5-1 - location
    pos-5-2 - location
    pos-5-3 - location
    pos-5-4 - location
    pos-5-5 - location
    pos-5-6 - location
    pos-5-7 - location
    pos-5-8 - location
    pos-5-9 - location
    pos-6-1 - location
    pos-6-2 - location
    pos-6-3 - location
    pos-6-4 - location
    pos-6-5 - location
    pos-6-6 - location
    pos-6-7 - location
    pos-6-8 - location
    pos-6-9 - location
    stone-01 - stone
    stone-02 - stone
    stone-03 - stone
    stone-04 - stone
  )
  (:init
    (IS-GOAL pos-3-5)
    (IS-GOAL pos-4-4)
    (IS-GOAL pos-4-5)
    (IS-GOAL pos-5-5)
    (IS-NONGOAL pos-1-1)
    (IS-NONGOAL pos-1-2)
    (IS-NONGOAL pos-1-3)
    (IS-NONGOAL pos-1-4)
    (IS-NONGOAL pos-1-5)
    (IS-NONGOAL pos-1-6)
    (IS-NONGOAL pos-1-7)
    (IS-NONGOAL pos-1-8)
    (IS-NONGOAL pos-1-9)
    (IS-NONGOAL pos-2-1)
    (IS-NONGOAL pos-2-2)
    (IS-NONGOAL pos-2-3)
    (IS-NONGOAL pos-2-4)
    (IS-NONGOAL pos-2-5)
    (IS-NONGOAL pos-2-6)
    (IS-NONGOAL pos-2-7)
    (IS-NONGOAL pos-2-8)
    (IS-NONGOAL pos-2-9)
    (IS-NONGOAL pos-3-1)
    (IS-NONGOAL pos-3-2)
    (IS-NONGOAL pos-3-3)
    (IS-NONGOAL pos-3-4)
    (IS-NONGOAL pos-3-6)
    (IS-NONGOAL pos-3-7)
    (IS-NONGOAL pos-3-8)
    (IS-NONGOAL pos-3-9)
    (IS-NONGOAL pos-4-1)
    (IS-NONGOAL pos-4-2)
    (IS-NONGOAL pos-4-3)
    (IS-NONGOAL pos-4-6)
    (IS-NONGOAL pos-4-7)
    (IS-NONGOAL pos-4-8)
    (IS-NONGOAL pos-4-9)
    (IS-NONGOAL pos-5-1)
    (IS-NONGOAL pos-5-2)
    (IS-NONGOAL pos-5-3)
    (IS-NONGOAL pos-5-4)
    (IS-NONGOAL pos-5-6)
    (IS-NONGOAL pos-5-7)
    (IS-NONGOAL pos-5-8)
    (IS-NONGOAL pos-5-9)
    (IS-NONGOAL pos-6-1)
    (IS-NONGOAL pos-6-2)
    (IS-NONGOAL pos-6-3)
    (IS-NONGOAL pos-6-4)
    (IS-NONGOAL pos-6-5)
    (IS-NONGOAL pos-6-6)
    (IS-NONGOAL pos-6-7)
    (IS-NONGOAL pos-6-8)
    (IS-NONGOAL pos-6-9)
    (MOVE-DIR pos-2-2 pos-2-3 dir-down)
    (MOVE-DIR pos-2-2 pos-3-2 dir-right)
    (MOVE-DIR pos-2-3 pos-2-2 dir-up)
    (MOVE-DIR pos-2-3 pos-2-4 dir-down)
    (MOVE-DIR pos-2-3 pos-3-3 dir-right)
    (MOVE-DIR pos-2-4 pos-2-3 dir-up)
    (MOVE-DIR pos-2-4 pos-3-4 dir-right)
    (MOVE-DIR pos-2-6 pos-2-7 dir-down)
    (MOVE-DIR pos-2-6 pos-3-6 dir-right)
    (MOVE-DIR pos-2-7 pos-2-6 dir-up)
    (MOVE-DIR pos-2-7 pos-2-8 dir-down)
    (MOVE-DIR pos-2-7 pos-3-7 dir-right)
    (MOVE-DIR pos-2-8 pos-2-7 dir-up)
    (MOVE-DIR pos-2-8 pos-3-8 dir-right)
    (MOVE-DIR pos-3-2 pos-2-2 dir-left)
    (MOVE-DIR pos-3-2 pos-3-3 dir-down)
    (MOVE-DIR pos-3-2 pos-4-2 dir-right)
    (MOVE-DIR pos-3-3 pos-2-3 dir-left)
    (MOVE-DIR pos-3-3 pos-3-2 dir-up)
    (MOVE-DIR pos-3-3 pos-3-4 dir-down)
    (MOVE-DIR pos-3-3 pos-4-3 dir-right)
    (MOVE-DIR pos-3-4 pos-2-4 dir-left)
    (MOVE-DIR pos-3-4 pos-3-3 dir-up)
    (MOVE-DIR pos-3-4 pos-3-5 dir-down)
    (MOVE-DIR pos-3-4 pos-4-4 dir-right)
    (MOVE-DIR pos-3-5 pos-3-4 dir-up)
    (MOVE-DIR pos-3-5 pos-3-6 dir-down)
    (MOVE-DIR pos-3-5 pos-4-5 dir-right)
    (MOVE-DIR pos-3-6 pos-2-6 dir-left)
    (MOVE-DIR pos-3-6 pos-3-5 dir-up)
    (MOVE-DIR pos-3-6 pos-3-7 dir-down)
    (MOVE-DIR pos-3-7 pos-2-7 dir-left)
    (MOVE-DIR pos-3-7 pos-3-6 dir-up)
    (MOVE-DIR pos-3-7 pos-3-8 dir-down)
    (MOVE-DIR pos-3-8 pos-2-8 dir-left)
    (MOVE-DIR pos-3-8 pos-3-7 dir-up)
    (MOVE-DIR pos-4-2 pos-3-2 dir-left)
    (MOVE-DIR pos-4-2 pos-4-3 dir-down)
    (MOVE-DIR pos-4-3 pos-3-3 dir-left)
    (MOVE-DIR pos-4-3 pos-4-2 dir-up)
    (MOVE-DIR pos-4-3 pos-4-4 dir-down)
    (MOVE-DIR pos-4-4 pos-3-4 dir-left)
    (MOVE-DIR pos-4-4 pos-4-3 dir-up)
    (MOVE-DIR pos-4-4 pos-4-5 dir-down)
    (MOVE-DIR pos-4-5 pos-3-5 dir-left)
    (MOVE-DIR pos-4-5 pos-4-4 dir-up)
    (MOVE-DIR pos-4-5 pos-5-5 dir-right)
    (MOVE-DIR pos-5-5 pos-4-5 dir-left)
    (MOVE-DIR pos-5-7 pos-5-8 dir-down)
    (MOVE-DIR pos-5-7 pos-6-7 dir-right)
    (MOVE-DIR pos-5-8 pos-5-7 dir-up)
    (MOVE-DIR pos-5-8 pos-5-9 dir-down)
    (MOVE-DIR pos-5-8 pos-6-8 dir-right)
    (MOVE-DIR pos-5-9 pos-5-8 dir-up)
    (MOVE-DIR pos-5-9 pos-6-9 dir-right)
    (MOVE-DIR pos-6-1 pos-6-2 dir-down)
    (MOVE-DIR pos-6-2 pos-6-1 dir-up)
    (MOVE-DIR pos-6-2 pos-6-3 dir-down)
    (MOVE-DIR pos-6-3 pos-6-2 dir-up)
    (MOVE-DIR pos-6-7 pos-5-7 dir-left)
    (MOVE-DIR pos-6-7 pos-6-8 dir-down)
    (MOVE-DIR pos-6-8 pos-5-8 dir-left)
    (MOVE-DIR pos-6-8 pos-6-7 dir-up)
    (MOVE-DIR pos-6-8 pos-6-9 dir-down)
    (MOVE-DIR pos-6-9 pos-5-9 dir-left)
    (MOVE-DIR pos-6-9 pos-6-8 dir-up)
    (at player-01 pos-2-2)
    (at player-02 pos-5-5)
    (at stone-01 pos-3-3)
    (at stone-02 pos-4-4)
    (at stone-03 pos-3-5)
    (at stone-04 pos-4-5)
    (at-goal stone-02)
    (at-goal stone-03)
    (at-goal stone-04)
    (clear pos-2-3)
    (clear pos-2-4)
    (clear pos-2-6)
    (clear pos-2-7)
    (clear pos-2-8)
    (clear pos-3-2)
    (clear pos-3-4)
    (clear pos-3-6)
    (clear pos-3-7)
    (clear pos-3-8)
    (clear pos-4-2)
    (clear pos-4-3)
    (clear pos-5-7)
    (clear pos-5-8)
    (clear pos-5-9)
    (clear pos-6-1)
    (clear pos-6-2)
    (clear pos-6-3)
    (clear pos-6-7)
    (clear pos-6-8)
    (clear pos-6-9)
  )
  (:goal (and
    (at-goal stone-01)
    (at-goal stone-02)
    (at-goal stone-03)
    (at-goal stone-04)
  ))
  (:metric minimize (total-time))
)

; plan
1. (move player-01 pos-2-2 pos-2-3 dir-down)
   deleted: (at player-01 pos-2-2) (clear pos-2-3)
   added: (at player-01 pos-2-3) (clear pos-2-2)
   goals met: 3 of 4
2. (move player-01 pos-2-3 pos-2-4 dir-down)
   deleted: (at player-01 pos-2-3) (clear pos-2-4)
   added: (at player-01 pos-2-4) (clear pos-2-3)
   goals met: 3 of 4
3. (move player-01 pos-2-4 pos-3-4 dir-right)
   deleted: (at player-01 pos-2-4) (clear pos-3-4)
   added: (at player-01 pos-3-4) (clear pos-2-4)
   goals met: 3 of 4
4. (push-to-nongoal player-01 stone-03 pos-3-4 pos-3-5 pos-3-6 dir-down)
   deleted: (at player-01 pos-3-4) (at stone-03 pos-3-5) (clear pos-3-6) (at-goal stone-03)
   added: (at player-01 pos-3-5) (at stone-03 pos-3-6) (clear pos-3-4)
   goals met: 2 of 4
5. (push-to-nongoal player-01 stone-03 pos-3-5 pos-3-6 pos-3-7 dir-down)
   deleted: (at player-01 pos-3-5) (at stone-03 pos-3-6) (clear pos-3-7)
   added: (at player-01 pos-3-6) (at stone-03 pos-3-7) (clear pos-3-5)
   goals met: 2 of 4
6. (push-to-goal player-02 stone-04 pos-5-5 pos-4-5 pos-3-5 dir-left)
   deleted: (at player-02 pos-5-5) (at stone-04 pos-4-5) (clear pos-3-5)
   added: (at player-02 pos-4-5) (at stone-04 pos-3-5) (clear pos-5-5)
   goals met: 2 of 4
7. (push-to-nongoal player-02 stone-02 pos-4-5 pos-4-4 pos-4-3 dir-up)
   deleted: (at player-02 pos-4-5) (at stone-02 pos-4-4) (clear pos-4-3) (at-goal stone-02)
   added: (at player-02 pos-4-4) (at stone-02 pos-4-3) (clear pos-4-5)
   goals met: 1 of 4
8. (move player-02 pos-4-4 pos-3-4 dir-left)
   deleted: (at player-02 pos-4-4) (clear pos-3-4)
   added: (at player-02 pos-3-4) (clear pos-4-4)
   goals met: 1 of 4
9. (move player-02 pos-3-4 pos-2-4 dir-left)
   deleted: (at player-02 pos-3-4) (clear pos-2-4)
   added: (at player-02 pos-2-4) (clear pos-3-4)
   goals met: 1 of 4
10. (move player-02 pos-2-4 pos-2-3 dir-up)
   deleted: (at player-02 pos-2-4) (clear pos-2-3)
   added: (at player-02 pos-2-3) (clear pos-2-4)
   goals met: 1 of 4
11. (move player-02 pos-2-3 pos-2-2 dir-up)
   deleted: (at player-02 pos-2-3) (clear pos-2-2)
   added: (at player-02 pos-2-2) (clear pos-2-3)
   goals met: 1 of 4
12. (move player-02 pos-2-2 pos-3-2 dir-right)
   deleted: (at player-02 pos-2-2) (clear pos-3-2)
   added: (at player-02 pos-3-2) (clear pos-2-2)
   goals met: 1 of 4
13. (move player-02 pos-3-2 pos-4-2 dir-right)
   deleted: (at player-02 pos-3-2) (clear pos-4-2)
   added: (at player-02 pos-4-2) (clear pos-3-2)
   goals met: 1 of 4
14. (push-to-goal player-02 stone-02 pos-4-2 pos-4-3 pos-4-4 dir-down)
   deleted: (at player-02 pos-4-2) (at stone-02 pos-4-3) (clear pos-4-4)
   added: (at player-02 pos-4-3) (at stone-02 pos-4-4) (clear pos-4-2) (at-goal stone-02)
   goals met: 2 of 4
15. (push-to-goal player-02 stone-02 pos-4-3 pos-4-4 pos-4-5 dir-down)
   deleted: (at player-02 pos-4-3) (at stone-02 pos-4-4) (clear pos-4-5)
   added: (at player-02 pos-4-4) (at stone-02 pos-4-5) (clear pos-4-3)
   goals met: 2 of 4
16. (move player-02 pos-4-4 pos-3-4 dir-left)
   deleted: (at player-02 pos-4-4) (clear pos-3-4)
   added: (at player-02 pos-3-4) (clear pos-4-4)
   goals met: 2 of 4
17. (move player-02 pos-3-4 pos-2-4 dir-left)
   deleted: (at player-02 pos-3-4) (clear pos-2-4)
   added: (at player-02 pos-2-4) (clear pos-3-4)
   goals met: 2 of 4
18. (push-to-nongoal player-01 stone-04 pos-3-6 pos-3-5 pos-3-4 dir-up)
   deleted: (at player-01 pos-3-6) (at stone-04 pos-3-5) (clear pos-3-4) (at-goal stone-04)
   added: (at player-01 pos-3-5) (at stone-04 pos-3-4) (clear pos-3-6)
   goals met: 1 of 4
19. (push-to-goal player-01 stone-02 pos-3-5 pos-4-5 pos-5-5 dir-right)
   deleted: (at player-01 pos-3-5) (at stone-02 pos-4-5) (clear pos-5-5)
   added: (at player-01 pos-4-5) (at stone-02 pos-5-5) (clear pos-3-5)
   goals met: 1 of 4
20. (move player-01 pos-4-5 pos-4-4 dir-up)
   deleted: (at player-01 pos-4-5) (clear pos-4-4)
   added: (at player-01 pos-4-4) (clear pos-4-5)
   goals met: 1 of 4
21. (move player-01 pos-4-4 pos-4-3 dir-up)
   deleted: (at player-01 pos-4-4) (clear pos-4-3)
   added: (at player-01 pos-4-3) (clear pos-4-4)
   goals met: 1 of 4
22. (push-to-goal player-02 stone-04 pos-2-4 pos-3-4 pos-4-4 dir-right)
   deleted: (at player-02 pos-2-4) (at stone-04 pos-3-4) (clear pos-4-4)
   added: (at player-02 pos-3-4) (at stone-04 pos-4-4) (clear pos-2-4) (at-goal stone-04)
   goals met: 2 of 4
23. (push-to-goal player-01 stone-04 pos-4-3 pos-4-4 pos-4-5 dir-down)
   deleted: (at player-01 pos-4-3) (at stone-04 pos-4-4) (clear pos-4-5)
   added: (at player-01 pos-4-4) (at stone-04 pos-4-5) (clear pos-4-3)
   goals met: 2 of 4
24. (move player-01 pos-4-4 pos-4-3 dir-up)
   deleted: (at player-01 pos-4-4) (clear pos-4-3)
   added: (at player-01 pos-4-3) (clear pos-4-4)
   goals met: 2 of 4
25. (move player-01 pos-4-3 pos-4-2 dir-up)
   deleted: (at player-01 pos-4-3) (clear pos-4-2)
   added: (at player-01 pos-4-2) (clear pos-4-3)
   goals met: 2 of 4
26. (move player-01 pos-4-2 pos-3-2 dir-left)
   deleted: (at player-01 pos-4-2) (clear pos-3-2)
   added: (at player-01 pos-3-2) (clear pos-4-2)
   goals met: 2 of 4
27. (move player-02 pos-3-4 pos-2-4 dir-left)
   deleted: (at player-02 pos-3-4) (clear pos-2-4)
   added: (at player-02 pos-2-4) (clear pos-3-4)
   goals met: 2 of 4
28. (push-to-nongoal player-01 stone-01 pos-3-2 pos-3-3 pos-3-4 dir-down)
   deleted: (at player-01 pos-3-2) (at stone-01 pos-3-3) (clear pos-3-4)
   added: (at player-01 pos-3-3) (at stone-01 pos-3-4) (clear pos-3-2)
   goals met: 2 of 4
29. (push-to-goal player-02 stone-01 pos-2-4 pos-3-4 pos-4-4 dir-right)
   deleted: (at player-02 pos-2-4) (at stone-01 pos-3-4) (clear pos-4-4)
   added: (at player-02 pos-3-4) (at stone-01 pos-4-4) (clear pos-2-4) (at-goal stone-01)
   goals met: 3 of 4
30. (move player-02 pos-3-4 pos-3-5 dir-down)
   deleted: (at player-02 pos-3-4) (clear pos-3-5)
   added: (at player-02 pos-3-5) (clear pos-3-4)
   goals met: 3 of 4
31. (move player-02 pos-3-5 pos-3-6 dir-down)
   deleted: (at player-02 pos-3-5) (clear pos-3-6)
   added: (at player-02 pos-3-6) (clear pos-3-5)
   goals met: 3 of 4
32. (move player-02 pos-3-6 pos-2-6 dir-left)
   deleted: (at player-02 pos-3-6) (clear pos-2-6)
   added: (at player-02 pos-2-6) (clear pos-3-6)
   goals met: 3 of 4
33. (move player-02 pos-2-6 pos-2-7 dir-down)
   deleted: (at player-02 pos-2-6) (clear pos-2-7)
   added: (at player-02 pos-2-7) (clear pos-2-6)
   goals met: 3 of 4
34. (move player-02 pos-2-7 pos-2-8 dir-down)
   deleted: (at player-02 pos-2-7) (clear pos-2-8)
   added: (at player-02 pos-2-8) (clear pos-2-7)
   goals met: 3 of 4
35. (move player-02 pos-2-8 pos-3-8 dir-right)
   deleted: (at player-02 pos-2-8) (clear pos-3-8)
   added: (at player-02 pos-3-8) (clear pos-2-8)
   goals met: 3 of 4
36. (push-to-nongoal player-02 stone-03 pos-3-8 pos-3-7 pos-3-6 dir-up)
   deleted: (at player-02 pos-3-8) (at stone-03 pos-3-7) (clear pos-3-6)
   added: (at player-02 pos-3-7) (at stone-03 pos-3-6) (clear pos-3-8)
   goals met: 3 of 4
37. (push-to-goal player-02 stone-03 pos-3-7 pos-3-6 pos-3-5 dir-up)
   deleted: (at player-02 pos-3-7) (at stone-03 pos-3-6) (clear pos-3-5)
   added: (at player-02 pos-3-6) (at stone-03 pos-3-5) (clear pos-3-7) (at-goal stone-03)
   goals met: 4 of 4
